benchmarks/09-normal.txt
GET /{code} with metrics and structured logging in place

Commit:   6b43d9a (working tree has uncommitted changes)
Date:     2026-09-04 18:09 IST
Machine:  Apple M5, 10 cores, macOS 26.6.2
Go:       go1.26.4
Postgres: 18.3 (Homebrew)
Rows:     500008

Method:   3s warm-up, then 5 runs of 10s at 50 concurrent,
          30 seconds between runs. Load generator, server and database all
          on this one machine.
Command:  hey -z 10s -c 50 -disable-redirects http://localhost:8080/seed250000

Results per run:

  run   req/s        p99
  1     42165        0.0016
  2     43067        0.0016
  3     42344        0.0016
  4     41744        0.0016
  5     42581        0.0016

  median   42344        0.0016
  slowest  41744        0.0016
  fastest  43067        0.0016

The median is the number to quote. The spread between fastest and slowest is
how much of a difference this machine produces on its own, so a change smaller
than that spread has not been shown to do anything.

--------------------------- raw output, run 1 ---------------------------


Summary:
  Total:	10.0009 secs
  Slowest:	0.0034 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	42164.6935
  
  Total data:	22770882 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [408]	|
  0.001 [21479]	|■■■
  0.001 [251046]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [139698]	|■■■■■■■■■■■■■■■■■■■■■■
  0.002 [8439]	|■
  0.002 [488]	|
  0.002 [78]	|
  0.003 [21]	|
  0.003 [11]	|
  0.003 [14]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0013 secs
  90%% in 0.0014 secs
  95%% in 0.0014 secs
  99%% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0012 secs, 0.0003 secs, 0.0031 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [302]	421683 responses



--------------------------- raw output, run 2 ---------------------------


Summary:
  Total:	10.0010 secs
  Slowest:	0.0067 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	43067.3281
  
  Total data:	23258664 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [23348]	|■■
  0.002 [400573]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [6721]	|■
  0.003 [23]	|
  0.003 [0]	|
  0.004 [0]	|
  0.005 [7]	|
  0.005 [10]	|
  0.006 [20]	|
  0.007 [13]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0013 secs
  90%% in 0.0014 secs
  95%% in 0.0014 secs
  99%% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0035 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0011 secs, 0.0003 secs, 0.0035 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [302]	430716 responses



--------------------------- raw output, run 3 ---------------------------


Summary:
  Total:	10.0009 secs
  Slowest:	0.0061 secs
  Fastest:	0.0003 secs
  Average:	0.0012 secs
  Requests/sec:	42343.9730
  
  Total data:	22867758 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [11388]	|■
  0.001 [391293]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [20640]	|■■
  0.003 [105]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [15]	|
  0.006 [11]	|
  0.006 [24]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0013 secs
  90%% in 0.0014 secs
  95%% in 0.0014 secs
  99%% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0039 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0023 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0012 secs, 0.0003 secs, 0.0025 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [302]	423477 responses



--------------------------- raw output, run 4 ---------------------------


Summary:
  Total:	10.0012 secs
  Slowest:	0.0063 secs
  Fastest:	0.0004 secs
  Average:	0.0012 secs
  Requests/sec:	41743.9492
  
  Total data:	22544352 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [20565]	|■■
  0.002 [387871]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [8912]	|■
  0.003 [41]	|
  0.003 [20]	|
  0.004 [24]	|
  0.004 [10]	|
  0.005 [17]	|
  0.006 [18]	|
  0.006 [9]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0013 secs
  90%% in 0.0014 secs
  95%% in 0.0014 secs
  99%% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0038 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.0012 secs, 0.0003 secs, 0.0041 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [302]	417488 responses



--------------------------- raw output, run 5 ---------------------------


Summary:
  Total:	10.0011 secs
  Slowest:	0.0057 secs
  Fastest:	0.0002 secs
  Average:	0.0012 secs
  Requests/sec:	42581.3610
  
  Total data:	22996494 bytes
  Size/request:	54 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [5317]	|■
  0.001 [366606]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [53469]	|■■■■■■
  0.002 [416]	|
  0.003 [2]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [18]	|
  0.005 [15]	|
  0.006 [17]	|


Latency distribution:
  10%% in 0.0010 secs
  25%% in 0.0011 secs
  50%% in 0.0012 secs
  75%% in 0.0013 secs
  90%% in 0.0014 secs
  95%% in 0.0014 secs
  99%% in 0.0016 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0035 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0009 secs
  resp wait:	0.0012 secs, 0.0002 secs, 0.0025 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [302]	425861 responses